# Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# *Пример:*
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]



nums_list = [2, 3, 4, 5, 6]
result_list = []
for i in range((len(nums_list)+1)//2):
    result_list.append(nums_list[i]*nums_list[len(nums_list)-1-i])
print(f"{nums_list} -> произведение пар чисел списка: {result_list}")

